[
"What did they wear on the first date?",
"Who is their embarrassing crush?",
"Who's the better kisser?",
"What is their star sign?",
"What's their weirded quirk?",
"Who said 'I love you' first?",
"Who is the tidiest?",
"Who is the best cook?",
"Who is most likely to deal with a spider?",
"Which Disney character are they most like?",
"What is their worst habit?",
"What is their pet name for you?",
"What is the thing they're most likely to end up in jail for?",
"What is the thing they're most likely to go viral for?",
"What is their favorite thing about you?",
"What is their favorite thing about themselves?",
"What is their favorite pizza topping?",
"What’s her bra size?",
"What is his shoe size?",
"What is the first movie you saw together?",
"What is their favorite movie?",
"What would be their last meal?",
"Would they rather spend an evening in with you, or a night out with you?",
"What are you most likely to argue about?",
"What is their favorite flavour of potato chips?",
"If they could only eat one food for the rest of their life, what would it be?",
"Who has the worst handwriting?",
"What celebrity couple are you most like?",
"What would be your partner’s dream job, other than the one they are doing now?",
"What's their most prized possession, or the item they'd save in a fire (apart from you!)?",
"How does your partner like their tea or coffee?",
"How does your partner like their eggs cooked?",
"If they could throw a themed party, what would it be?",
"Who is the better driver?",
"What’s their dream car?",
"What is their go-to karaoke song?",
"Who has the most exes?",
"What celebrity would they want to be stuck on a desert island with?",
"What's their favorite movie/band/TV show, if they're trying to be cool?",
"What's their favorite movie/band/TV show, if they're being honest?",
"What was their first pet called?",
"What's their favorite thing that you wear?",
"Which item of clothing of theirs do you hate the most?",
"Who would win in a game of Monopoly?",
"What is their biggest fear?",
"What is their favorite flavour of ice-cream?",
"If they were on ‘Who Wants to be a Millionaire’, who would their phone-a-friend be?",
"What was the best present they ever gave you?",
"Your partner wins the lotto – how would they spend it?",
"Who will be the most hungover after the wedding?"
]